Autodesk.Revit.DB.CylindricalFace.Radius(System.Int32)
Radii of the surface.

Autodesk.Revit.DB.CylindricalFace.Axis
Axis of the surface.

Autodesk.Revit.DB.CylindricalFace.Origin
Origin of the surface.

Autodesk.Revit.DB.CylindricalFace
A cylindrical face of a 3d solid or open shell.
Remarks: For details on the parameterization, refer to the documentation for Autodesk.Revit.DB.CylindricalSurface.